---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.GetSubFoldersData
source: html/68ac11a5-1134-4944-3d57-e002cd376bec.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.GetSubFoldersData Method

Gets the subfolders data under the folder path of the browser data.

## Syntax (C#)
```csharp
public IList<ExternalResourceSubFolder> GetSubFoldersData()
```

## Returns
The subfolders data under folder path of the browser data.